In [ ]:
import pandas as pd

In [162]:
def top3_popular_names(years):
    names_by_year = {}
    for year in years:
        path = f'names/yob{year}.txt'
        names_by_year[year] = pd.read_csv(path, names=['Name', 'Gender', 'Count'])
    names_all = pd.concat(names_by_year)
    names_all = names_all.groupby(['Name']).sum().sort_values('Count', ascending=False)[:3]
    return names_all

In [163]:
top3_popular_names([1900, 1950, 2000])

         Count
Name
James   111789
John    109601
Robert  101368

In [164]:
top3_popular_names([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [175]:
def count_dynamics(years):   
    names_by_year = {}
    for year in years:
        path = f'names/yob{year}.txt'
        names_by_year[year] = pd.read_csv(path, names=['Name', 'Gender', 'Count'])
    names_all = pd.concat(names_by_year).reset_index(level=1, drop=True)
    names_all = names_all.groupby([names_all.index, 'Gender']).sum()
    names_all = names_all.unstack('Gender')
    return names_all

In [176]:
count_dynamics([1900, 1950, 2000])

          Count
Gender        F        M
1900     299798   150480
1950    1713065  1790437
2000    1815295  1963202